src/DataProcessors/ит_ГрупповаяУстановкаЛимитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ит_ГрупповаяУстановкаЛимитов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоступныеПериодыОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Магазины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Настройки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Минимум</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Максимум</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаяМинимум</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаяМаксимум</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лимит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Интервал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИТ_Интервалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ит_ЛимитыДСВМагазинах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ит_ЛимитыДСВМагазинах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДеньМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>Блок учета продаж товаров и оказания услуг</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество проданного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыручкаБезНДС</Name>
					<Comment>Выручка без НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыручкаДоПримененияСкидки</Name>
					<Comment>Выручка до применения скидки с НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыручкаДоПримененияСкидкиБезНДС</Name>
					<Comment>Выручка до применения скидки в валюте регл. учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Comment>Себестоимость в валюте регл. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСВходящий</Name>
					<Comment>Сумма входящего НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьБезНДС</Name>
					<Comment>Себестоимость в валюте регл. учета без учета налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСУпр</Name>
					<Comment>Сумма НДС в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыручкаБезНДСУпр</Name>
					<Comment>Выручка без НДС в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидкиУпр</Name>
					<Comment>Сумма скидки в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыручкаДоПримененияСкидкиУпр</Name>
					<Comment>Выручка до применения скидки с НДС в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыручкаДоПримененияСкидкиБезНДСУпр</Name>
					<Comment>Выручка до применения скидки в валюте управленческого учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьУпр</Name>
					<Comment>Себестоимость в валюте упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСВходящийУпр</Name>
					<Comment>Сумма входящего НДС в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьБезНДСУпр</Name>
					<Comment>Себестоимость в валюте упр. учета без учета налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был зафиксирован факт продажи товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Проданный товар или оказанная услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщик у которого товар был куплен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Покупатель который купил товар или которому была оказана услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар мы продали (собственный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с покупателем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании с которого товар был продан</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/DataProcessors/ит_ГрупповаяУстановкаЛимитов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьПометки(Команда)
	УстановитьСнятьПометки(Истина,"Магазины");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьПометки(Флажок,ИмяТЧ)
	Для каждого ТСтрока Из Объект[ИмяТЧ] Цикл
		ТСтрока.Пометка = Флажок;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьСнятьПометки(Ложь,"Магазины");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Условия_Интервалы = СформироватьУсловияИнтервалы();
	Если Условия_Интервалы <> "" Тогда 
		Запрос = Новый Запрос;
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Магазины.Ссылка КАК Магазин
		|ПОМЕСТИТЬ ВТ_РаботающиеМагазины
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК Магазины
		|ГДЕ
		|	(Магазины.ит_ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ Магазины.ит_ДатаЗакрытия > КОНЕЦПЕРИОДА(&Период, ДЕНЬ))
		|	И (НЕ Магазины.ит_Архив)
		|	И Магазины.ит_ДатаОткрытия <= КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|	И НЕ Магазины.ит_ДатаОткрытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И НЕ Магазины.ПометкаУдаления
		|	И НЕ Магазины.ит_Закрыта = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ит_ЛимитыДСВМагазинах.Магазин
		|ПОМЕСТИТЬ ВТ_МагазиныУстановленныеЛимиты
		|ИЗ
		|	РегистрСведений.ит_ЛимитыДСВМагазинах КАК ит_ЛимитыДСВМагазинах
		|ГДЕ
		|	ит_ЛимитыДСВМагазинах.Магазин В
		|			(ВЫБРАТЬ
		|				ВТ_РаботающиеМагазины.Магазин
		|			ИЗ
		|				ВТ_РаботающиеМагазины КАК ВТ_РаботающиеМагазины)
		|	И ит_ЛимитыДСВМагазинах.Период = &Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыручкаЗаНеделю.Магазин,
		//|	СРЕДНЕЕ(ВТ_ВыручкаЗаНеделю.СуммаВыручки) КАК СуммаВыручки
		|	ВЫБОР
		|		КОГДА РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, #ВАРИАНТ#) = 0 ТОГДА
		|			СУММА(ВТ_ВыручкаЗаНеделю.СуммаВыручки)
		|		ИНАЧЕ
		|			СУММА(ВТ_ВыручкаЗаНеделю.СуммаВыручки)/РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, #ВАРИАНТ#)
		|	КОНЕЦ КАК СуммаВыручки
		//|	СУММА(ВТ_ВыручкаЗаНеделю.СуммаВыручки)/РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, #ВАРИАНТ#) КАК СуммаВыручки
		|ПОМЕСТИТЬ ВТ_ВыручкаСредняя
		|ИЗ
		|	(ВЫБРАТЬ
		|		#ВАРИАНТ#(ТаблицаПродаж.Период) КАК Период,
		|		ВТ_РаботающиеМагазины.Магазин КАК Магазин,
		|		СУММА(ТаблицаПродаж.Сумма) КАК СуммаВыручки
		|	ИЗ
		|		ВТ_РаботающиеМагазины КАК ВТ_РаботающиеМагазины
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		РегистрНакопления.Продажи КАК ТаблицаПродаж
		|	ПО
		|		ТаблицаПродаж.ПодразделениеКомпании = ВТ_РаботающиеМагазины.Магазин
		|	ГДЕ
		|		ТаблицаПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода И 
		|		ТаблицаПродаж.Регистратор ССЫЛКА Документ.ЗакрытиеСмены
		|	СГРУППИРОВАТЬ ПО
		|		#ВАРИАНТ#(ТаблицаПродаж.Период),
		|		ВТ_РаботающиеМагазины.Магазин) КАК ВТ_ВыручкаЗаНеделю
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВыручкаЗаНеделю.Магазин
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РаботающиеМагазины.Магазин,
		|	ВТ_РаботающиеМагазины.Магазин.ИТ_СуммаЛимита КАК СуммаЛимита
		|ПОМЕСТИТЬ ВТ_ФиксЛимиты
		|ИЗ
		|	ВТ_РаботающиеМагазины КАК ВТ_РаботающиеМагазины
		|ГДЕ
		|	ВТ_РаботающиеМагазины.Магазин.ИТ_ФиксированныйЛимит
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_РаботающиеМагазины.Магазин,
		|	ВТ_РаботающиеМагазины.Магазин.ИТ_СуммаЛимита
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РаботающиеМагазины.Магазин,
		|	ИСТИНА КАК Пометка,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ФиксЛимиты.СуммаЛимита, 0) > 0
		|			ТОГДА ВТ_ФиксЛимиты.СуммаЛимита
		|		ИНАЧЕ ВЫБОР
		//|				КОГДА ЕСТЬNULL(ВТ_ВыручкаСредняя.СуммаВыручки, 0) <= 100000
		//|					ТОГДА 3000
		//|				КОГДА ЕСТЬNULL(ВТ_ВыручкаСредняя.СуммаВыручки, 0) > 100000
		//|						И ЕСТЬNULL(ВТ_ВыручкаСредняя.СуммаВыручки, 0) <= 210000
		//|					ТОГДА 5000
		//|				КОГДА ЕСТЬNULL(ВТ_ВыручкаСредняя.СуммаВыручки, 0) > 210000
		//|						И ЕСТЬNULL(ВТ_ВыручкаСредняя.СуммаВыручки, 0) <= 350000
		//|					ТОГДА 7000
		//|				КОГДА ЕСТЬNULL(ВТ_ВыручкаСредняя.СуммаВыручки, 0) > 350000
		//|						И ЕСТЬNULL(ВТ_ВыручкаСредняя.СуммаВыручки, 0) < 600000
		//|					ТОГДА 15000
		//|				КОГДА ЕСТЬNULL(ВТ_ВыручкаСредняя.СуммаВыручки, 0) >= 600000
		//|					ТОГДА 20000
		|				#УСЛОВИЯ_ИНТЕРВАЛЫ#
		|			КОНЕЦ
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	ВТ_РаботающиеМагазины КАК ВТ_РаботающиеМагазины
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыручкаСредняя КАК ВТ_ВыручкаСредняя
		|		ПО ВТ_РаботающиеМагазины.Магазин = ВТ_ВыручкаСредняя.Магазин
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФиксЛимиты КАК ВТ_ФиксЛимиты
		|		ПО ВТ_РаботающиеМагазины.Магазин = ВТ_ФиксЛимиты.Магазин
		|ГДЕ
		|	НЕ ВТ_РаботающиеМагазины.Магазин В
		|				(ВЫБРАТЬ
		|					ВТ_МагазиныУстановленныеЛимиты.Магазин
		|				ИЗ
		|					ВТ_МагазиныУстановленныеЛимиты КАК ВТ_МагазиныУстановленныеЛимиты)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_РаботающиеМагазины.Магазин.Код";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#ВАРИАНТ#",ВРег(СокрЛП(Объект.Вариант)));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#УСЛОВИЯ_ИНТЕРВАЛЫ#",Условия_Интервалы);
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Период",НачалоДня(Объект.ДатаУстановки));
		НачалоПериода = ?(Объект.Вариант = Перечисления.ДоступныеПериодыОтчета.День,НачалоДня(ПериодАнализаВыручки.ДатаНачала),?(Объект.Вариант = Перечисления.ДоступныеПериодыОтчета.Неделя,НачалоНедели(ПериодАнализаВыручки.ДатаНачала),НачалоМесяца(ПериодАнализаВыручки.ДатаНачала)));
		КонецПериода = ?(Объект.Вариант = Перечисления.ДоступныеПериодыОтчета.День,КонецДня(ПериодАнализаВыручки.ДатаОкончания),?(Объект.Вариант = Перечисления.ДоступныеПериодыОтчета.Неделя,КонецНедели(ПериодАнализаВыручки.ДатаОкончания),КонецМесяца(ПериодАнализаВыручки.ДатаОкончания)));
		Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода",КонецПериода);
		Объект.Магазины.Загрузить(Запрос.Выполнить().Выгрузить());  	
	Иначе
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не заполнены настройки по интервалам!";
		СообщениеПользователю.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьУсловияИнтервалы()
	НачалоУсловия = "
					|				КОГДА ЕСТЬNULL(ВТ_ВыручкаСредняя.СуммаВыручки, 0) ";
	ЧастьИ		 = 	"
					|						И ";
	ЧастьУсловия = 	" ЕСТЬNULL(ВТ_ВыручкаСредняя.СуммаВыручки, 0) ";
	КонецУсловия = 	"
					|					ТОГДА ";
	ТекстУсловияПолный = "";
	Для каждого ТСтрокаИнтервалы Из Объект.Настройки Цикл
		ТекстУсловия = "";
		Если ЗначениеЗаполнено(ТСтрокаИнтервалы.Минимум) Тогда 
			ТекстУсловия = ТекстУсловия + НачалоУсловия + ?(ТСтрокаИнтервалы.ВключаяМинимум,">= ","> ")	+ Формат(ТСтрокаИнтервалы.Минимум,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
		КонецЕсли;
		Если ЗначениеЗаполнено(ТСтрокаИнтервалы.Максимум) Тогда
			Если ТекстУсловия = "" Тогда 
				ТекстУсловия = ТекстУсловия + НачалоУсловия + ?(ТСтрокаИнтервалы.ВключаяМаксимум,"<= ","< ") + Формат(ТСтрокаИнтервалы.Максимум,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
			Иначе
				ТекстУсловия = ТекстУсловия + ЧастьИ + ЧастьУсловия + ?(ТСтрокаИнтервалы.ВключаяМаксимум,"<= ","< ")	+ Формат(ТСтрокаИнтервалы.Максимум,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
			КонецЕсли;
		КонецЕсли;
		ТекстУсловия = ТекстУсловия + КонецУсловия + Формат(ТСтрокаИнтервалы.Лимит,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
		ТекстУсловияПолный = ТекстУсловияПолный + ТекстУсловия;
	КонецЦикла;
	
	Возврат ТекстУсловияПолный;
	
КонецФункции

&НаСервере
Процедура УстановитьЛимитыНаСервере(ИдентСтроки)
	ТекСтрока = Объект.Магазины.НайтиПоИдентификатору(ИдентСтроки);
	Если ТекСтрока <> Неопределено Тогда 
		НДокумент = Документы.ит_УстановкаЛимитаНаличныхДенегВМагазине.СоздатьДокумент();
		НДокумент.ОбработкаЗаполнения(Неопределено);
		НДокумент.Дата = Объект.ДатаУстановки;
		НДокумент.Магазин = ТекСтрока.Магазин;
		НДокумент.Сумма = ТекСтрока.Сумма;
		НДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		НДокумент.Комментарий = "#Создан групповой установкой лимитов";
		Попытка
			НДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Инфо = ИнформацияОбОшибке();
			ТекстОшибки = Инфо.Описание + ?(Инфо.Причина <> Неопределено,": " + Инфо.Причина.Описание, "");
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Установка лимита для магазина: " + ТекСтрока.Магазин + " не выполнена! Причина: " + ТекстОшибки;
			СообщениеПользователю.Поле = ТекСтрока.Магазин;
			СообщениеПользователю.Сообщить();
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЛимиты(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныеСтроки = Объект.Магазины.НайтиСтроки(Новый Структура("Пометка",Истина));
	КолСтрок = ВыбранныеСтроки.Количество();
	НПП = 0;
	Для каждого ТСтрока Из ВыбранныеСтроки Цикл
		УстановитьЛимитыНаСервере(ТСтрока.ПолучитьИдентификатор());
		НПП = НПП + 1;
		Прогресс = Цел(НПП/КолСтрок*100);
		Состояние("Подождите выполняется обработка...", Прогресс,"Устанавливаются лимиты",БиблиотекаКартинок.ДлительнаяОперация48);
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаУстановки) И
		ЗначениеЗаполнено(Объект.Вариант) И
		ЗначениеЗаполнено(ПериодАнализаВыручки) Тогда 
		ЗаполнитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВариантПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Вариант) Тогда 
		Запрос = Новый Запрос;
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИТ_ШаблоныИнтерваловПоЛимитамКассСрезПоследних.Интервал.Порядок КАК Порядок,
		|	ИТ_ШаблоныИнтерваловПоЛимитамКассСрезПоследних.Интервал.Минимум КАК Минимум,
		|	ИТ_ШаблоныИнтерваловПоЛимитамКассСрезПоследних.Интервал.Максимум КАК Максимум,
		|	ИТ_ШаблоныИнтерваловПоЛимитамКассСрезПоследних.Интервал.ВключаяМинимум КАК ВключаяМинимум,
		|	ИТ_ШаблоныИнтерваловПоЛимитамКассСрезПоследних.Интервал.ВключаяМаксимум КАК ВключаяМаксимум,
		|	ИТ_ШаблоныИнтерваловПоЛимитамКассСрезПоследних.Интервал.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ИТ_ШаблоныИнтерваловПоЛимитамКассСрезПоследних.Интервал КАК Интервал,
		|	ИТ_ШаблоныИнтерваловПоЛимитамКассСрезПоследних.Лимит
		|ИЗ
		|	РегистрСведений.ИТ_ШаблоныИнтерваловПоЛимитамКасс.СрезПоследних(&ДатаСреза, Вариант = &Вариант) КАК ИТ_ШаблоныИнтерваловПоЛимитамКассСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ДатаСреза",?(ЗначениеЗаполнено(Объект.ДатаУстановки),КонецДня(Объект.ДатаУстановки),ТекущаяДата()));
		Запрос.УстановитьПараметр("Вариант",Объект.Вариант);
		Объект.Настройки.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВариантПриИзменении(Элемент)
	ВариантПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкуНаСервере()
	Для каждого ТСтрокаН Из Объект.Настройки Цикл
		Если НЕ ЗначениеЗаполнено(ТСтрокаН.Интервал) Тогда 
			//создадим интервал
			ТСтрокаН.Интервал = СоздатьПолучитьИнтервал(ТСтрокаН);
		КонецЕсли;
	КонецЦикла;
	
	ДокументШаблон = ПолучитьСоздатьШаблон();
	Если ДокументШаблон.ЛимитыПоИнтервалам.Количество()>0 Тогда 
		ДокументШаблон.ЛимитыПоИнтервалам.Очистить();
	КонецЕсли;
	Для каждого ТСтрокаН Из Объект.Настройки Цикл
		НСтрокаДок = ДокументШаблон.ЛимитыПоИнтервалам.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрокаДок,ТСтрокаН);
	КонецЦикла; 
	ДокументШаблон.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаСервере
Функция ПолучитьСоздатьШаблон()
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ИТ_ШаблоныИнтерваловПоЛимитамКасс.Ссылка КАК Документ
	|ИЗ
	|	Документ.ИТ_ШаблоныИнтерваловПоЛимитамКасс КАК ИТ_ШаблоныИнтерваловПоЛимитамКасс
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ИТ_ШаблоныИнтерваловПоЛимитамКасс.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|	И ИТ_ШаблоныИнтерваловПоЛимитамКасс.Вариант = &Вариант";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Дата",Объект.ДатаУстановки);
	Запрос.УстановитьПараметр("Вариант",Объект.Вариант);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументШаблон = Выборка.Документ.ПолучитьОбъект();
		ДокументШаблон.Комментарий = "Обновлен при сохранении настроек из обработки #ит_ГрупповаяУстановкаЛимитов " + ТекущаяДата();
	Иначе
		ДокументШаблон = Документы.ИТ_ШаблоныИнтерваловПоЛимитамКасс.СоздатьДокумент();
		ДокументШаблон.Дата = Объект.ДатаУстановки;
		ДокументШаблон.Вариант = Объект.Вариант;
		//ДокументШаблон.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ДокументШаблон.Комментарий = "Создан при сохранении настроек из обработки #ит_ГрупповаяУстановкаЛимитов " + ТекущаяДата();
	КонецЕсли;
	Возврат ДокументШаблон;
КонецФункции

&НаСервере
Функция СоздатьПолучитьИнтервал(СтрокаСДанными)
	НайденныйИнтервал = НайтиПоходящийИнтервал(СтрокаСДанными);
	Если НайденныйИнтервал = Неопределено Тогда 
		НовыйИнтервал = Справочники.ИТ_Интервалы.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НовыйИнтервал,СтрокаСДанными);
		НовыйИнтервал.Порядок = СтрокаСДанными.НомерСтроки;
		СформироватьНаименованиеИнтервала(НовыйИнтервал);
		//НовыйИнтервал.Владелец = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя","РегистрСведений.ИТ_ШаблоныИнтерваловПоЛимитамКасс");
		НовыйИнтервал.Записать();
		НайденныйИнтервал = НовыйИнтервал.Ссылка;
	КонецЕсли;
	Возврат НайденныйИнтервал;
КонецФункции

&НаСервере
Процедура СформироватьНаименованиеИнтервала(НовыйИнтервал)
	НижняяГраница	= Формат(НовыйИнтервал.Минимум, "ЧДЦ=2; ЧРГ=' '; ЧН=0; ЧГ=3,0");
	ВерхняяГраница	= Формат(НовыйИнтервал.Максимум, "ЧДЦ=2; ЧРГ=' '; ЧН=0; ЧГ=3,0");
	ЕдИзмСтрока		= ?(ЗначениеЗаполнено(НовыйИнтервал.ЕдиницаИзмерения), " " + Строка(НовыйИнтервал.ЕдиницаИзмерения), ".");
	
	Если ЗначениеЗаполнено(НовыйИнтервал.Минимум) 
		И ЗначениеЗаполнено(НовыйИнтервал.Максимум) Тогда 
		НовыйИнтервал.Наименование = НижняяГраница + " - " + ВерхняяГраница + ЕдИзмСтрока; 
	ИначеЕсли ЗначениеЗаполнено(НовыйИнтервал.Минимум) Тогда 
		НовыйИнтервал.Наименование = "свыше " + НижняяГраница + ЕдИзмСтрока;
	ИначеЕсли ЗначениеЗаполнено(НовыйИнтервал.Максимум) Тогда 
		НовыйИнтервал.Наименование = "до " + ВерхняяГраница + ЕдИзмСтрока;
	Иначе
		НовыйИнтервал.Наименование = "Пустой интервал";		
	КонецЕсли;
	
	НовыйИнтервал.Наименование = НовыйИнтервал.Наименование + " (" + СокрЛП(Объект.Вариант) + ")";
КонецПроцедуры

&НаСервере
Функция НайтиПоходящийИнтервал(СтрокаСДанными)
	ПодходящийИнтервал = Неопределено;
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ИТ_Интервалы.Ссылка КАК Интервал
	|ИЗ
	|	Справочник.ИТ_Интервалы КАК ИТ_Интервалы
	|ГДЕ
	|	ИТ_Интервалы.Минимум = &Минимум
	|	И ИТ_Интервалы.Максимум = &Максимум
	|	И ИТ_Интервалы.ВключаяМинимум = &ВключаяМинимум
	|	И ИТ_Интервалы.ВключаяМаксимум = &ВключаяМаксимум
	|	И ИТ_Интервалы.Наименование ПОДОБНО &Вариант
	|	И ИТ_Интервалы.ЕдиницаИзмерения = &ЕдиницаИзмерения";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Минимум",СтрокаСДанными.Минимум);
	Запрос.УстановитьПараметр("Максимум",СтрокаСДанными.Максимум);
	Запрос.УстановитьПараметр("ВключаяМинимум",СтрокаСДанными.ВключаяМинимум);
	Запрос.УстановитьПараметр("ВключаяМаксимум",СтрокаСДанными.ВключаяМаксимум);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",СтрокаСДанными.ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("Вариант","%"+СокрЛП(Объект.Вариант)+"%");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПодходящийИнтервал = Выборка.Интервал;
	КонецЕсли;
	Возврат ПодходящийИнтервал;
КонецФункции

&НаКлиенте
Процедура СохранитьНастройку(Команда)
	СохранитьНастройкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("383");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекущиеДанные = Элементы.Настройки.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ЕдиницаИзмерения) Тогда 
			ТекущиеДанные.ЕдиницаИзмерения = ЕдиницаИзмерения;		
		КонецЕсли;
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ЕдиницаИзмерения",ТекущиеДанные.ЕдиницаИзмерения);
		СтруктураПоиска.Вставить("Минимум",ТекущиеДанные.Минимум);
		СтруктураПоиска.Вставить("Максимум",ТекущиеДанные.Максимум);
		СтруктураПоиска.Вставить("ВключаяМинимум",ТекущиеДанные.ВключаяМинимум);
		СтруктураПоиска.Вставить("ВключаяМаксимум",ТекущиеДанные.ВключаяМаксимум);
		СтруктураПоиска.Вставить("ВключаяМаксимум",ТекущиеДанные.ВключаяМаксимум);
		ТекущиеДанные.Интервал = НайтиПоходящийИнтервал(СтруктураПоиска);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытыеКолонки(Команда)
	Если Элементы.НастройкиПоказатьСкрытыеКолонки.Пометка Тогда 
		Элементы.НастройкиПоказатьСкрытыеКолонки.Пометка = Ложь;
		ПоказатьКолонки = Ложь;
	Иначе
		Элементы.НастройкиПоказатьСкрытыеКолонки.Пометка = Истина;
		ПоказатьКолонки = Истина;
	КонецЕсли;
	Элементы.НастройкиЕдиницаИзмерения.Видимость = ПоказатьКолонки;
	Элементы.НастройкиИнтервал.Видимость = ПоказатьКолонки;
КонецПроцедуры
